[{"name": "U. Schroeder", "paper": [{"id": 1, "paper_id": "fcb1205f3306fe3267bebea0e0294ee0a940a321", "authors": "U. Schroeder,Hendrik Thüs,Simona Dakova,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/fcb1205f3306fe3267bebea0e0294ee0a940a321", "title": "Tag-based collaborative filtering recommendation in personal learning environments", "abstract": "The personal learning environment (PLE) concept offers a learner-centric view of learning and suggests a shift from knowledge-push to knowledge-pull approach to learning. One concern with a PLE-driven knowledge-pull approach to learning, however, is information overload. Recommender systems can provide an effective mechanism to deal with the information overload problem in PLEs. In this paper, we study different tag-based collaborative filtering recommendation techniques on their applicability and effectiveness in PLE settings. We implement 16 different tag-based collaborative filtering recommendation algorithms, memory based as well as model based, and compare them in terms of accuracy and user satisfaction. The results of the conducted offline and user evaluations reveal that the quality of user experience does not correlate with high-recommendation accuracy.", "year": 2013, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "a743a13d7288542cbd9d29c770aa820b613f05a4", "authors": "U. Schroeder,Mohamed Amine Chatti,Hendrik Thüs,S. Sharifi,Navid Gooranourimi,C. Greven,", "url": "https://www.semanticscholar.org/paper/a743a13d7288542cbd9d29c770aa820b613f05a4", "title": "Seamless Application Ecologies as Mobile Personal Learning Environments", "abstract": "The demands on today\u0092s learner have changed over the recent years as the understanding of his role evolved. Getting away from the traditional top-down approaches, the learner is more and more in control of selecting learning resources or choosing the right learning techniques. On the one hand, by following the idea of a learner-centric Personal Learning Environment it is now possible to freely design an own learning environment with all required tools to improve the learning process. On the other hand, the ubiquitous usage of mobile devices such as smart phones or tablet computers creates the basis for new modern learning scenarios. While different applications for the devices already allow an individual aggregation of tools they are still highly separated and cannot interact beyond the borders of one application. In this paper, we present a new approach realizing application ecologies on mobile devices which allow integrating services and functionalities of one application into another one. This may happen ad-hoc without involvement of application developers resulting in high extensibility. Furthermore, it allows the user to adjust the app system according to his needs and creates the impression of one seamless mobile PLE consisting of an adjustable set of applications.", "year": 2015, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "99371136f37ef54cf39d0abeae20fff86b16c517", "authors": "U. Schroeder,C. Greven,", "url": "https://www.semanticscholar.org/paper/99371136f37ef54cf39d0abeae20fff86b16c517", "title": "2SIMPLE - Symbiotic Interrelated Seamless Integrated Mobile Personalizable Learning Environments", "abstract": "The concept of Personal Learning Environments (PLEs) is increasingly gaining im- portance in academic teaching, private life and occupational settings. The learner is put into focus and offered general conditions for self-organized learning. At the same time mobile technology is becoming omnipresent and an essential part of today's learning. Although many (web) frameworks have been developed allowing the user to create his own PLE the mobile learner is not really reached. Although the mobile application architecture supports the PLE concept in general in the sense of aggregating different independent tools, the missing interrelations cause losses of contexts while switching between them. At the same time, necessary additional information cannot be presented in context as an enhancement creating added value. This paper introduces a concept for symbiotic interrelation and seamless integration of mobile applications as mobile personalizable learning environments where the user is in control of shap- ing his mobile learning environment seamlessly. Services and features of applications can be used inside one another and even across the borders of a single device. Thereby, contexts of one appli- cation can be used in further services and additional information can be visualized directly embed- ded where it is needed. Moreover, the seamless design comes with additional benefits such as advanced navigation and improves the learning process in its entirety.", "year": 2015, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "eac183e4eb977ae3851c5164d33c76a1ad822d7e", "authors": "Marold Wosnitza,U. Schroeder,Mohamed Amine Chatti,A. Yousef,", "url": "https://www.semanticscholar.org/paper/eac183e4eb977ae3851c5164d33c76a1ad822d7e", "title": "A Usability Evaluation of a Blended MOOC Environment: An Experimental Case Study.", "abstract": "In the past few years, there has been an increasing interest in Massive Open Online Courses (MOOCs) as a new form of Technology-Enhanced Learning (TEL), in higher education and beyond. Recognizing the limitations of standalone MOOCs, blended MOOCs (bMOOCs) that aim at bringing in-class (i.e. face-to-face) interactions and online learning components together have emerged as an alternative MOOC model of teaching and learning in a higher education context. In this paper, we present the design, implementation, and evaluation details of a bMOOC course on “Teaching Methodologies” at Fayoum University, Egypt in cooperation with RWTH Aachen University, Germany, provided using the bMOOC platform L2P-bMOOC. In order to gauge the usability and effectiveness of the course, we employed an evaluation approach based on Conole’s 12 dimensions rubrics, ISONORM 9241/110-S as a general usability evaluation, and a custom effectiveness questionnaire reflecting the different MOOC stakeholder perspectives.", "year": 2015, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "05c48457d69cba3f76aee221ec95d616bdf7d2cf", "authors": "Marold Wosnitza,U. Schroeder,Mohamed Amine Chatti,A. Yousef,", "url": "https://www.semanticscholar.org/paper/05c48457d69cba3f76aee221ec95d616bdf7d2cf", "title": "What Drives a Successful MOOC? An Empirical Examination of Criteria to Assure Design Quality of MOOCs", "abstract": "Massive Open Online Courses (MOOCs) have gained a lot of attention in the last years as a new technology enhanced learning (TEL) approach in higher education. MOOCs provide more educational opportunities to a massive number of learners to attend free online courses around the globe. Discussions around MOOCs have been focusing on the potential, social, institutional, technological, relevance, and marketing issues and less on the quality design of MOOC environments. Several studies have reported a high drop-out rate in average of 95% of course participants and other pedagogical problems concerning assessment and feedback. Thus, the quality of MOOCs design is worth additional investigation. Although several studies identified a large set of criteria to the successful design of TEL systems in general, not all of them can be used in the MOOC context, due to some unique features of MOOCs. This study is a first step towards identifying specific criteria that need to be considered when designing and implementing MOOCs. The results of this empirical study are based on a large survey targeting learners as well as professors, both with MOOC experience. As a result, we identified and rated 74 indicators classified into our two main dimensions of pedagogical and technological criteria distributed over six categories. From these, the learning analytics and assessment categories were found to be the key features for effective MOOCs.", "year": 2014, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "b493b31940c77cff26d7cdae25d83bb4490d5947", "authors": "U. Schroeder,Arnab Chakrabarti,C. Greven,Usman Wahid,A. Yousef,Arham Muslim,Hendrik Thüs,Vlatko Lukarov,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/b493b31940c77cff26d7cdae25d83bb4490d5947", "title": "Learning Analytics: Challenges and Future Research Directions", "abstract": "eleed, Iss. 10 - In recent years, learning analytics (LA) has attracted a great deal of attention in technology-enhanced learning (TEL) research as practitioners, institutions, and researchers are increasingly seeing the potential that LA has to shape the future TEL landscape. Generally, LA deals with the development of methods that harness educational data sets to support the learning process. This paper provides a foundation for future research in LA. It provides a systematic overview on this emerging field and its key concepts through a reference model for LA based on four dimensions, namely data, environments, context (what?), stakeholders (who?), objectives (why?), and methods (how?). It further identifies various challenges and research opportunities in the area of LA in relation to each dimension.", "year": 2014, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "28aa6b0617d43fe4ed77e2cd37001d7326f37096", "authors": "U. Schroeder,Mohamed Amine Chatti,Fahmy Yousef,A. Mohamed,", "url": "https://www.semanticscholar.org/paper/28aa6b0617d43fe4ed77e2cd37001d7326f37096", "title": "Video-Based Learning: A Critical Analysis of The Research Published in 2003-2013 and Future Visions", "abstract": "Video-Based Learning (VBL) has a long history in the educational design research. In the past decade, the interest in VBL has increased as a result of new forms of online education, such as flipped classrooms, and most prominently MOOCs. VBL has unique features that make it an effective Technology-Enhanced Learning (TEL) approach. This study critically analyzed the current research of VBL published in 2003-2013 to build a deep understanding on what are the educational benefits and effectiveness that VBL has on teaching and learning. 67 peer reviewed papers were selected in this review and categorized into four main dimensions, namely, effectiveness, teaching methods, design, and reflection. In the light of the discussion of current research in terms of these categories, we present the future vision and research opportunities of VBL that support self-organized and network learning.", "year": 2014, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "251b560b66d285eb458680316b2bec672aff96d9", "authors": "U. Schroeder,Mohamed Amine Chatti,Arham Muslim,Vlatko Lukarov,A. L. Dyckhoff,", "url": "https://www.semanticscholar.org/paper/251b560b66d285eb458680316b2bec672aff96d9", "title": "Supporting action research with learning analytics", "abstract": "Learning analytics tools should be useful, i.e., they should be usable and provide the functionality for reaching the goals attributed to learning analytics. This paper seeks to unite learning analytics and action research. Based on this, we investigate how the multitude of questions that arise during technology-enhanced teaching and learning systematically can be mapped to sets of indicators. We examine, which questions are not yet supported and propose concepts of indicators that have a high potential of positively influencing teachers' didactical considerations. Our investigation shows that many questions of teachers cannot be answered with currently available research tools. Furthermore, few learning analytics studies report about measuring impact. We describe which effects learning analytics should have on teaching and discuss how this could be evaluated.", "year": 2013, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "c9a34a7decac8fa486a68e493e1d0466a8d59ae5", "authors": "D. Dahl,U. Schroeder,M. Specht,M. Jarke,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/c9a34a7decac8fa486a68e493e1d0466a8d59ae5", "title": "Model-driven mashup personal learning environments", "abstract": "Mashups have become the driving force behind the development of personal learning environments (PLEs). Creating mashups in an ad hoc manner is, however, for end users with little or no programming background not an easy task. Various tools and platforms have been built in an attempt to support mashup creation. These platforms, however, are still considered complex and do not address crucial challenges in mashup development today, such as scalability, interoperability, reuse, and automatic service invocation and mediation. In this paper, we leverage the possibility to use the concept of model-driven mashup development (MDMD) as an approach that can drastically tackle the aforementioned issues and drive the rapid and user-friendly creation of mashups. We then present the conceptual and technical details of PLEF-Ext as a flexible framework for end-user, model-driven development (MDD) of mashup PLEs.", "year": 2011, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "bbf29b3ee5197d98b558fdbecc00cb2fd859e211", "authors": "Hendrik Thüs,U. Schroeder,A. L. Dyckhoff,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/bbf29b3ee5197d98b558fdbecc00cb2fd859e211", "title": "Forschungsfeld Learning Analytics", "abstract": "Summary Learning analytics has attracted a great deal of attention in technology enhanced learning (TEL) in recent years as educational institutions and researchers are increasingly seeing the potential that learning analytics has to support the learning process. Learning analytics has been identified as a possible key future trend in learning and teaching (Johnson et al., 2011). Analytics can be a powerful tool to support learning. There are, however, a number of issues that need to be addressed before starting analytics projects. In this paper, we identify various challenges and research opportunities in the emerging area of learning analytics. Zusammenfassung Das Thema Learning Analytics hat in letzter Zeit große Aufmerksamkeit erlangt. Es verspricht, vor allem selbstgesteuerte Lernprozesse zu unterstützen, die typisch für das E-Learning in Verbindung mit Web 2.0 und sozialen Medien sind. Dabei wird versucht, durch Aufzeichnung, Analyse und geeignete Präsentation von Lernaktivitäten und deren Kontext, die Reflexion und Optimierung eines Lehrangebots oder des Lernverhaltens zu fördern. In Johnson et al. (2011) wurde Learning Analytics als eine der Schlüsseltechnologien für zukünftige Lehr- und Lernansätze identifiziert. Einige der damit verbundenen Forschungsfragen werden in diesem Artikel vorgestellt.", "year": 2012, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "ab7644cd2fa8f8b5a424d53585ae4f5af1a8393e", "authors": "M. Jarke,U. Schroeder,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/ab7644cd2fa8f8b5a424d53585ae4f5af1a8393e", "title": "LaaN: Convergence of Knowledge Management and Technology-Enhanced Learning", "abstract": "Knowledge Management (KM) and Technology-Enhanced Learning (TEL) have attracted attention over the past two decades and are meanwhile considered as important means to increase individual and organizational performance. There is, however, a wide agreement that traditional KM and TEL models have failed to cope with the fast-paced change and critical challenges of the new knowledge era. In this paper, we propose a vision for future KM/TEL approaches which aims to fulfill the needs of the new knowledge landscape by introducing the Learning as a Network (LaaN) theory as a new learning theory characterized by the convergence of KM and TEL within a learner-centric knowledge environment. We further discuss a possible implementation of the LaaN theory based on the personal learning environment (PLE) concept.", "year": 2012, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "7cddc49156d3c9473d4aefbeac2f9e632f78a095", "authors": "Arham Muslim,Mohamed Amine Chatti,U. Schroeder,M. B. Bashir,", "url": "https://www.semanticscholar.org/paper/7cddc49156d3c9473d4aefbeac2f9e632f78a095", "title": "A Modular Visualization Framework for the Open Learning Analytics Platform", "abstract": "No abstract available", "year": 2016, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "aa8d38f64df48de2c6de807b2dedd01b70e1a17c", "authors": "U. Schroeder,Memoona Mughal,Mohamed Amine Chatti,Arham Muslim,", "url": "https://www.semanticscholar.org/paper/aa8d38f64df48de2c6de807b2dedd01b70e1a17c", "title": "The Goal - Question - Indicator Approach for Personalized Learning Analytics -", "abstract": "Open learning analytics (OLA) is a relatively new branch of learning analytics (LA) which emerged due to the growing demand for self-organized, networked, and lifelong learning opportunities. OLA deals with learning data collected from various learning environments and contexts, analyzed with a range of analytics methods, and for different stakeholders with diverse interests and objectives. This diversity in different dimensions of OLA is a challenge which needs to be addressed by adopting a personalized learning analytics (PLA) model. Current implementations of LA mainly rely on a predefined set of questions and indicators which is not suitable in the context of OLA where the indicators are unpredictable. In this paper we present the goal question indicator (GQI) approach for PLA and provide the conceptual, design, implementation and evaluation details of the indicator engine component of the open learning analytics platform (OpenLAP) that engages end users in the indicator generation process by supporting them in setting goals, posing questions, and self-defining", "year": 2017, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "a2b6f53a555c7b2ead2b7c6afb8ff02ad0c5cc74", "authors": "U. Schroeder,Mohamed Amine Chatti,Usman Wahid,", "url": "https://www.semanticscholar.org/paper/a2b6f53a555c7b2ead2b7c6afb8ff02ad0c5cc74", "title": "Improving Peer Assessment by using Learning Analytics", "abstract": "In recent years, peer assessment has established itself as one of the most promising methods of assessment in open learning environments typically in massive open online courses (MOOCs). However, researchers are still working on ways to address a number of challenges in peer assessment. In this paper, we propose some solutions from the field of learning analytics which have the potential to provide significant value in the peer assessment process.", "year": 2016, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "39a32cf346bfe3dd9d1df060fa11bae74e526a0b", "authors": "U. Schroeder,Oscal Eduardo Barrios Varela,M. B. Bashir,Mohamed Amine Chatti,Arham Muslim,", "url": "https://www.semanticscholar.org/paper/39a32cf346bfe3dd9d1df060fa11bae74e526a0b", "title": "A Modular and Extensible Framework for Open Learning Analytics", "abstract": "Open Learning Analytics (OLA) is an emerging concept in the field of Learning Analytics (LA). It deals with learning data collected from multiple environments and contexts, analyzed with a wide range of analytics methods to address the requirements of different stakeholders. Due to this diversity in different dimensions of OLA, the LA developers and researchers face numerous challenges while designing solutions for OLA. The Open Learning Analytics Platform (OpenLAP) is a framework that addresses these issues and lays the foundation for an ecosystem of OLA that aims at supporting learning and teaching in fragmented, diverse, and networked learning environments. It follows a user-centric approach to engage end users in flexible definition and dynamic generation of personalized indicators. In this paper, we address a subset of OLA challenges and present the conceptual and implementation details of the analytics framework component of OpenLAP, which follows a flexible architecture that allows the easy integration of new analytics methods and visualization techniques in OpenLAP to support end users in defining indicators based on their needs in order to embed the results into their personal learning environment.", "year": 2018, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "a1c7a95b79a6754dfd2de448364b6e5fbffe9589", "authors": "U. Schroeder,Arham Muslim,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/a1c7a95b79a6754dfd2de448364b6e5fbffe9589", "title": "Toward an Open Learning Analytics Ecosystem", "abstract": "No abstract available", "year": 2017, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "064a61d8c2a35f2b79f9a5187aefde1e3a32df23", "authors": "Marold Wosnitza,U. Schroeder,Mohamed Amine Chatti,Usman Wahid,A. Yousef,", "url": "https://www.semanticscholar.org/paper/064a61d8c2a35f2b79f9a5187aefde1e3a32df23", "title": "The Effect of Peer Assessment Rubrics on Learners' Satisfaction and Performance Within a Blended MOOC Environment", "abstract": "Massive Open Online Courses (MOOCs) have a remarkable ability to expand access to a large scale of \n \nparticipants worldwide, beyond the formality of the higher education systems. MOOCs support participants \n \nto be actively involved in collaborative learning and construct their own learning experience in a variety of \n \ndomains. However, one of the biggest challenges facing MOOCs is how to assess the learnersâ\u0080\u0099 performance \n \nin a massive learning environment beyond traditional automated assessment methods. To address this \n \nchallenge, peer assessment has been proposed as an effective assessment method in MOOCs. The problem \n \nis, however, how to ensure the quality of the peer assessment in terms of validity and reliability. Moreover, \n \nassessment in blended MOOCs (bMOOCs) introduces unique challenges regarding the best peer assessment \n \nmodel in a learning environment that brings together face-to-face interactions and online activities. This \n \npaper presents the details of a study conducted to investigate peer assessment in bMOOCs. The study results \n \nshow that flexible rubrics have the potential to make the feedback process more accurate, credible, \n \ntransparent, valid, and reliable, thus ensuring the quality of the peer assessment task.", "year": 2015, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "7c7308046e4fe2291a415dbf137dfa6be6637fb5", "authors": "U. Schroeder,Mohamed Amine Chatti,A. Yousef,", "url": "https://www.semanticscholar.org/paper/7c7308046e4fe2291a415dbf137dfa6be6637fb5", "title": "The State of Video-Based Learning: A Review and Future Perspectives", "abstract": "The pedagogical strength of Video-Based Learning (VBL) is presenting knowledge in consistent and attractive manner. In recent years, the new forms and technologies of VBL such as flipped classrooms, and most prominently MOOCs, have had a remarkable impact on teaching and learning methodologies. A significant number of academic publications have investigated and analyzed VBL environments from different perspectives, including potential usage, effects on learning outcomes, satisfaction levels, and effectiveness. This study provides a critical analysis of the current research in VBL conducted from 2003 until today. We aim to help educators in building deeper understanding about the educational benefits of VBL. In this study, 76 peer reviewed papers are identified through journals and academic databases and they are categorized into four main dimensions: effectiveness, teaching methods, design, and reflection. In the scope of this analysis, we also provide future visions and research opportunities in VBL that support self-organized and network learning. Keywords-Video-Based Learning; VBL; MOOC; Review of Research; Blended Learning; Video Design; Flipped Classroom; Technology-Enhanced Learning.", "year": 2014, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "4033a12e07b7cfefe5771d7d7050683506832411", "authors": "U. Schroeder,Mohamed Amine Chatti,Mareike Bültmann,Dennis Zielke,A. L. Dyckhoff,", "url": "https://www.semanticscholar.org/paper/4033a12e07b7cfefe5771d7d7050683506832411", "title": "Design and Implementation of a Learning Analytics Toolkit for Teachers", "abstract": "Introduction Learning Management Systems (LMS) or Virtual Learning Environments (VLE) are widely used and have become part of the common toolkits of educators (Schroeder, 2009). One of the main goals of the integration of traditional teaching methods with technology enhancements is the improvement of teaching and learning quality in large university courses with many students. But does utilizing a VLE automatically improve teaching and learning? In our experience, many teachers just upload existing files, like lecture slides, handouts and exercises, when starting to use a VLE. Thereby availability of learning resources is improved. For improving teaching and learning it could be helpful to create more motivating, challenging, and engaging learning materials and e.g., collaborative scenarios to improve learning among large groups of students. Teachers could e.g., use audio and video recordings of their lectures or provide interactive, demonstrative multimedia examples and quizzes. If they put effort in the design of such online learning activities, they need tools that help them observe the consequences of their actions and evaluate their teaching interventions. They need to have appropriate access to data to assess changing behaviors and performances of their students to estimate the level of improvement that has been achieved in the learning environment. With the establishment of TEL, a new research field, called Learning Analytics, is emerging (Elias, 2011). This research field borrows and synthesizes techniques from different related fields, such as Educational Data Mining (EDM), Academic Analytics, Social Network Analysis or Business Intelligence (BI), to harness them for converting educational data into useful information and thereon to motivate actions, like self-reflecting ones previous teaching or learning activities, to foster improved teaching and learning. The main goal of BI is to turn enterprise data into useful information for management decision support. However, Learning Analytics, Academic Analytics, as well as EDM more specifically focus on tools and methods for exploring data coming from educational contexts. While Academic Analytics take a university-wide perspective, including also e.g., organizational and financial issues (Campbell & Oblinger, 2007), Learning Analytics as well as EDM focus specifically on data about teaching and learning. Siemens (2010) defines Learning Analytics as \"the use of intelligent data, learner-produced data, and analysis models to discover information and social connections, and to predict and advise on learning.\" It can support teachers and students to take action based on the evaluation of educational data. However, the technology to deliver this potential is still very young and research on understanding the pedagogical usefulness of Learning Analytics is still in its infancy (Johnson et al., 2011b; Johnson et al., 2012). It is a current goal at RWTH Aachen University to enhance its VLE--the learning and teaching portal L2P (Gebhardt et al., 2007)--with user-friendly tools for Learning Analytics, in order to equip their teachers and tutors with means to evaluate the effectiveness of TEL within their instructional design and courses offered. These teachers still face difficulties, deterring them from integrating cyclical reflective research activities, comparable to Action Research, into everyday practice. Action Research is characterized by a continuing effort to closely interlink, relate and confront action and reflection, to reflect upon one's conscious and unconscious doings in order to develop one's actions, and to act reflectively in order to develop one's knowledge.\" (Altrichter et al., 2005, p. 6). A pre-eminent barrier is the additional workload, originating from tasks of collecting, integrating, and analyzing raw data from log files of their VLE (Altenbernd-Giani et al., 2009). To tackle these issues, we have developed the \"exploratory Learning Analytics Toolkit\" (eLAT). …", "year": 2012, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "3f204f1eaef37645f1d84ab784d813370704bca7", "authors": "U. Schroeder,T. Mahapatra,Mohamed Amine Chatti,Arham Muslim,", "url": "https://www.semanticscholar.org/paper/3f204f1eaef37645f1d84ab784d813370704bca7", "title": "A rule-based indicator definition tool for personalized learning analytics", "abstract": "In the last few years, there has been a growing interest in learning analytics (LA) in technology-enhanced learning (TEL). Generally, LA deals with the development of methods that harness educational data sets to support the learning process. Recently, the concept of open learning analytics (OLA) has received a great deal of attention from LA community, due to the growing demand for self-organized, networked, and lifelong learning opportunities. A key challenge in OLA is to follow a personalized and goal-oriented LA model that tailors the LA task to the needs and goals of multiple stakeholders. Current implementations of LA rely on a predefined set of questions and indicators. There is, however, a need to adopt a personalized LA approach that engages end users in the indicator definition process by supporting them in setting goals, posing questions, and self-defining the indicators that help them achieve their goals. In this paper, we address the challenge of personalized LA and present the conceptual, design, and implementation details of a rule-based indicator definition tool to support flexible definition and dynamic generation of indicators to meet the needs of different stakeholders with diverse goals and questions in the LA exercise.", "year": 2016, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "25edd3803ca94930a78f64176c1686961873f24e", "authors": "U. Schroeder,Hendrik Thues,Peyman Toreini,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/25edd3803ca94930a78f64176c1686961873f24e", "title": "SNA-Based Recommendation in Professional Learning Environments", "abstract": "Recommender systems can provide effective means to support self-organization and networking in professional learning environments. In this paper, we leverage social network analysis (SNA) methods to improve interest-based recommendation in professional learning networks. We discuss two approaches for interest-based recommendation using SNA and compare them with conventional collaborative filtering (CF)-based recommendation methods. The user evaluation results based on the ResQue framework confirm that SNA-based CF recommendation outperform traditional CF methods in terms of coverage and thus can provide an effective solution to the sparsity and cold start problems in recommender systems.", "year": 2016, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "38dafa2943de6ed36d0959946786547b4f543ed0", "authors": "U. Schroeder,", "url": "https://www.semanticscholar.org/paper/38dafa2943de6ed36d0959946786547b4f543ed0", "title": "Web-Based Learning - Yes We Can!", "abstract": "No abstract available", "year": 2009, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "a307135c3ee55fcaf89b62fc62b1c0bca3176a1e", "authors": "Hendrik Thüs,U. Schroeder,A. L. Dyckhoff,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/a307135c3ee55fcaf89b62fc62b1c0bca3176a1e", "title": "A reference model for learning analytics", "abstract": "Recently, there is an increasing interest in learning analytics in Technology-Enhanced Learning TEL. Generally, learning analytics deals with the development of methods that harness educational datasets to support the learning process. Learning analytics LA is a multi-disciplinary field involving machine learning, artificial intelligence, information retrieval, statistics and visualisation. LA is also a field in which several related areas of research in TEL converge. These include academic analytics, action analytics and educational data mining. In this paper, we investigate the connections between LA and these related fields. We describe a reference model for LA based on four dimensions, namely data and environments what?, stakeholders who?, objectives why? and methods how?. We then review recent publications on LA and its related fields and map them to the four dimensions of the reference model. Furthermore, we identify various challenges and research opportunities in the area of LA in relation to each dimension.", "year": 2012, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "55c0661f5c4ea6a6e8372b0534c1a25bc9015b81", "authors": "U. Schroeder,Hendrik Thüs,Mohamed Amine Chatti,Xiao-Lan Pu,", "url": "https://www.semanticscholar.org/paper/55c0661f5c4ea6a6e8372b0534c1a25bc9015b81", "title": "Wiki-LDA: A Mixed-Method Approach for Effective Interest Mining on Twitter Data", "abstract": "Learning analytics (LA) and Educational data mining (EDM) have emerged as promising technology enhanced \n \nlearning (TEL) research areas in recent years. Both areas deal with the development of methods \n \nthat harness educational data sets to support the learning process. A key area of application for LA and EDM \n \nis learner modelling. Learner modelling enables to achieve adaptive and personalized learning environments, \n \nwhich are able to take into account the heterogeneous needs of learners and provide them with tailored learning \n \nexperience suited for their unique needs. As learning is increasingly happening in open and distributed \n \nenvironments beyond the classroom and access to information in these environments is mostly interest-driven, \n \nlearner interests need to constitute an important learner feature to be modeled. In this paper, we focus on \n \nthe interest dimension of a learner model and present Wiki-LDA as a novel method to effectively mine userâ\u0080\u0099s \n \ninterests in Twitter. We apply a mixed-method approach that combines Latent Dirichlet Allocation (LDA), \n \ntext mining APIs, and wikipedia categories. Wiki-LDA has proven effective at the task of interest mining and \n \nclassification on Twitter data, outperforming standard LDA.", "year": 2016, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "97552480480b465d4969a122293974c0602526fb", "authors": "Marold Wosnitza,Mohamed Amine Chatti,Imran Ahmad,U. Schroeder,A. Yousef,", "url": "https://www.semanticscholar.org/paper/97552480480b465d4969a122293974c0602526fb", "title": "An Evaluation of Learning Analytics in a Blended MOOC Environment", "abstract": "Massive Open Online Courses (MOOCs) present an emerging branch of online learning that is gaining interest in the Technology-Enhanced Learning (TEL) community. Due to the massive nature of MOOCs, the amount of learning activities might become very large or too complex to be tracked by the course participants. Learning analytics can provide great support to learners in their MOOC experience. In this paper, we focus on the application of learning analytics from a learner perspective to support self-organized and network learning in MOOCs through personalization of the learning environment, monitoring of the learning process, awareness, self-reflection, and recommendation. We present the details of a study we conducted to evaluate the usability and effectiveness of the learning analytics module in the blended MOOC platform.", "year": 2015, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "4d09aa2aefc7469addee6e5f30453a9f1ef6b8ab", "authors": "U. Schroeder,A. Yousef,Z. Sofyan,Ridho Laksono,Oleksandr Sabov,Momchil Marinov,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/4d09aa2aefc7469addee6e5f30453a9f1ef6b8ab", "title": "Video annotation and analytics in CourseMapper", "abstract": "No abstract available", "year": 2016, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "14019103b32ed8bef52bb538d1be131c8ad87000", "authors": "U. Schroeder,Marold Wosnitza,Mohamed Amine Chatti,A. Yousef,", "url": "https://www.semanticscholar.org/paper/14019103b32ed8bef52bb538d1be131c8ad87000", "title": "A Cluster Analysis of MOOC Stakeholder Perspectives", "abstract": "Massive Open Online Courses (MOOCs) are providing opportunities for thousands of learners to participate in free higher education courses online. MOOCs have unique features that make them an effective Technology-Enhanced Learning (TEL) approach. Institutions are offering a growing variety of MOOCs. Nevertheless, there are several crucial challenges that should be considered in the development of MOOCs, e.g., the drop-out rate of over 95% of course participants. One of the potential reasons for that is the complexity and diversity of MOOC participants. This diversity is not only related to the cultural and demographic profile, but also considers the diverse motives and perspectives when enrolled in MOOCs. This paper aims to cluster and analyze the different objectives of MOOC stakeholders to build a deeper and better understanding of their behaviors. Our main finding was a set of eight clusters, i.e., blended learning, flexibility, high quality content, instructional design and learning methodologies, lifelong learning, network learning, openness, and student-centered learning. This cluster schema creates a meaningful picture for the MOOC community.ResumenLos cursos en línea masivos y abiertos (Massive Open Online Courses, MOOC) proporcionan oportunidades ilimitadas para la participación de miles de estudiantes en cursos de enseñanza superior en línea. Los MOOC tienen características únicas que los convierten en un método efectivo del aprendizaje electrónico, en concreto el aprendizaje mejorado por tecnología (Technology-Enhanced Learning, TEL). Numerosas instituciones ofrecen una creciente variedad de MOOC. Sin embargo, existen múltiples retos que deben ser considerados al desarrollar MOOC, por ejemplo, la tasa de abandono de participantes en los cursos es del 95%. Una de las posibles razones para ello es la complejidad y la diversidad de los participantes en los MOOC. Está diversidad no está solamente relacionada con el perfil demográfico y cultural, sino también con los diversos motivos y perspectivas que los usuarios tienen al inscribirse en MOOC. La intención de este artículo es agrupar en dústeres los objetivos de los participantes en MOOC y analizarlos para lograr una mayor comprensión de sus comportamientos. El principal resultado es el descubrimiento de ocho clústeres: aprendizaje mezclado (blended learning), flexibilidad (flexibility), contenido de alta calidad (high quality content), diseño instruccional y metodologías de aprendizaje (instructional design and learning methodologies), aprendizaje a lo largo de la vida (lifelong learning), aprendizaje en red (network learning), apertura (openness) y aprendizaje centrado en el estudiante (student-centered learning). Este esquema de agrupamiento en clústeres crea una visión significativa para la comunidad de participantes en MOOC.", "year": 2015, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "4afc34e71ae4a972b68eac0b791fe44f2bd835f8", "authors": "U. Schroeder,Mohamed Amine Chatti,Dennis Zielke,A. L. Dyckhoff,", "url": "https://www.semanticscholar.org/paper/4afc34e71ae4a972b68eac0b791fe44f2bd835f8", "title": "eLAT: An Exploratory Learning Analytics Tool for Reflection and Iterative Improvement of Technology Enhanced Learning", "abstract": "Educators are in need for powerful Learning Analytics tools in order to improve the effectiveness of their courses and to enhance their students’ performance. In order to help educators to self-reflect on their technology-enhanced teaching and learning scenarios and to help them identify opportunities for interventions and improvements, it is important to provide comprehensible indicators for determining quality and efficiency. In this paper, we present an overview on the goals, requirements, and design of eLAT, a Learning Analytics toolkit which enables teachers to explore and correlate content usage, user properties, user behavior, as well as assessment results based on graphical indicators. The primary aim of eLAT is to process large data sets in real time with regard to individual research interests of teachers and data privacy issues.", "year": 2011, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "528d952005675525ab673b69c0cf9eb2aebbc3a4", "authors": "Harald Jakobs,Marold Wosnitza,U. Schroeder,Mohamed Amine Chatti,A. Yousef,", "url": "https://www.semanticscholar.org/paper/528d952005675525ab673b69c0cf9eb2aebbc3a4", "title": "MOOCs - A Review of the State-of-the-Art", "abstract": "Massive open online courses (MOOCs) have drastically changed the way we learn as well as how we teach. The main aim of MOOCs is to provide new opportunities to a massive number of learners to attend free online courses from anywhere all over the world. MOOCs have unique features that make it an effective technology-enhanced learning (TEL) model in higher education and beyond. The number of academic publications around MOOCs has grown rapidly in the last few years. The purpose of this paper is to compile and analyze the state-of-the-art in MOOC research that has been conducted in the past five years. A template analysis was used to map the conducted research on MOOCs into seven dimensions, namely concept, design, learning theories, case studies, business model, targets groups, and assessment. This classification schema aims at providing a comprehensive overview for readers who are interested in MOOCs to foster a common understanding of key concepts in this emerging field. The paper further suggests new challenges and opportunities for future work in the area of MOOCs that will support communication between researchers as they seek to address these challenges.", "year": 2014, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "994eafa82809076901a183139fc26f334d7b8c6a", "authors": "U. Schroeder,Hendrik Thüs,Mohamed Amine Chatti,C. Greven,", "url": "https://www.semanticscholar.org/paper/994eafa82809076901a183139fc26f334d7b8c6a", "title": "Context-Aware Mobile Professional Learning in PRiME", "abstract": "No abstract available", "year": 2014, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "7d5eaea930f613e99a535d77acb024d3942a798d", "authors": "U. Schroeder,Togrul Mageramov,Bogdan Kyryliuk,Christoph Pallasch,Esra Yalcin,Mohamed Amine Chatti,Hendrik Thüs,", "url": "https://www.semanticscholar.org/paper/7d5eaea930f613e99a535d77acb024d3942a798d", "title": "Mobile learning in context", "abstract": "The widespread use of mobile technologies has led to an increasing interest in mobile learning. Context is a central topic of research in that area. In fact, a major benefit of mobile devices is that they enable learning across contexts. In this paper, we explore how context can deliver significant benefits in mobile learning and provide an extensive review of the current literature and research on mobile learning in context. Furthermore, we identify various challenges and research opportunities in this area and propose the conceptual framework CAMeL for context-aware mobile learning.", "year": 2012, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "279febbe874e71728d8d80348cc8ecff58522198", "authors": "U. Schroeder,C. Greven,Hendrik Thüs,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/279febbe874e71728d8d80348cc8ecff58522198", "title": "Layered Knowledge Networking in Professional Learning Environments", "abstract": "Knowledge Management (KM) and Technology Enhanced Learning (TEL) became a very important issue \n \nin modern organizational professional learning and work process integration. Former learning and KM \n \ntheories which characterize knowledge as a thing or process no longer fit today's digital world where the \n \namount of required information is no more manageable and the half-time of knowledge in general is rapidly \n \ndecreasing. Younger approaches such as the Learning as a Network (LaaN) theory describe knowledge as \n \ncomplex and emergent and put a heavier focus on knowledge networking. The LaaN theory further stresses \n \nthe convergence of the learning and work processes in professional learning settings and views KM and \n \nTEL as two sides of the same coin. Driven by the LaaN theory, the Professional Reflective Mobile Personal \n \nLearning Environments (PRiME) project describes an integrated KM and TEL framework which connects \n \nlearning and work processes. It enables the professional learner to harness implicit knowledge and offers \n \nknowledge networking at three different layers: the Personal Learning Environment (PLE), the Personal \n \nKnowledge Network (PKN) and the Network of Practice (NoP). Continuous knowledge networking results \n \nin constant evolution of knowledge leading to personal as well as organizational learning.", "year": 2015, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "bf2b0fa52358746651a975c0baf49a690c788a3c", "authors": "U. Schroeder,Hendrik Thüs,Darko Dugoija,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/bf2b0fa52358746651a975c0baf49a690c788a3c", "title": "Learner Modeling in Academic Networks", "abstract": "Learning analytics (LA) deals with the development of methods that harness educational data sets to support the learning process. To achieve particular learner entered LA objectives such as intelligent feedback, adaptation, personalization, or recommendation, learner modeling is a crucial task. Learner modeling enables to achieve adaptive and personalized learning environments, which are able to take into account the heterogeneous needs of learners and provide them with tailored learning experience suited for their unique needs. In this paper, we focus on learner modeling in academic networks. We present theoretical, design, implementation, and evaluation details of PALM, a service for personal academic learner modeling. The primary aim of PALM is to harness the distributed publication information to build an academic learner model.", "year": 2014, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "e203a6f83b90a69719879f9409a004df6ee14117", "authors": "Mohamed Amine Chatti,U. Schroeder,Usman Wahid,", "url": "https://www.semanticscholar.org/paper/e203a6f83b90a69719879f9409a004df6ee14117", "title": "A Systematic Analysis of Peer Assessment in the MOOC Era and Future Perspectives", "abstract": "Massive Online Open Courses (MOOCs) have become a cost and time effective choice for learners all across the globe. This has led to new challenges for teachers such as providing valuable and quality assessment and feedback on such a large scale. Recent studies have found peer assessment where learners assess the work of their peers to be a viable and cost effective alternative to teacher/staff evaluation. This study systematically analyzes the current research on peer assessment published in the context of MOOCs and the online tools that are being used in MOOCs for peer assessment. 48 peer reviewed papers and 17 peer assessment tools were selected for the comparison in this study and were assessed on three main dimensions, namely, system design, efficiency and effectiveness. In the light of the comparison and discussion of current research in terms of these categories, we present future visions and research dimensions to improve the peer assessment process in MOOCs. Keywords-Open Assessment; Peer Assessment; MOOC; Blended Learning; Peer Reviews, Online Assessment.", "year": 2016, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "9f52c498da7b9f5555d836ea6cfc4854df05f671", "authors": "U. Schroeder,C. Greven,Arham Muslim,Fatemeh Salehian Kia,Hendrik Thüs,Mohamed Amine Chatti,Vlatko Lukarov,", "url": "https://www.semanticscholar.org/paper/9f52c498da7b9f5555d836ea6cfc4854df05f671", "title": "Data Models in Learning Analytics", "abstract": "There are many different ways and models how to characterize usage data to enable representation of user actions across learning management system, and systems in general. Based on this data, learning analytics can perform different analysis and provide personalized and meaningful information to improve the learning and teaching processes. There is a variety of usage data formats that are already successfully used in exiting systems. These different usage data formats have their advantages and disadvantage that have to be considered when using them in the context of learning analytics. In this paper, several usage data formats are presented and analyzed in the context of learning analytics to help in choosing the best suiting usage data model.", "year": 2014, "updated_on": "2022", "created_on": "2022"}], "interests": ["user modeling", "educational technology", "lifelong learning", "artificial intelligence", "learning technologies", "gamification", "higher education", "open educational resources", "anti-phishing", "serious games", "cybersecurity", "xAPI"], "score": 35, "id": "145517928"}, {"name": "Arham Muslim", "paper": [{"id": 1, "paper_id": "674d624f04b0b6c9a046a544c062f28012b73bdd", "authors": "Arham Muslim,Qurat Ul Ain,Shoeb Joarder,Thao Ngo,Laura Vorgerd,Mouadh Guesmi,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/674d624f04b0b6c9a046a544c062f28012b73bdd", "title": "Is More Always Better? The Effects of Personal Characteristics and Level of Detail on the Perception of Explanations in a Recommender System", "abstract": "Despite the acknowledgment that the perception of explanations may vary considerably between end-users, explainable recommender systems (RS) have traditionally followed a one-size-fits-all model, whereby the same explanation level of detail is provided to each user, without taking into consideration individual user’s context, i.e., goals and personal characteristics. To fill this research gap, we aim in this paper at a shift from a one-size-fits-all to a personalized approach to explainable recommendation by giving users agency in deciding which explanation they would like to see. We developed a transparent Recommendation and Interest Modeling Application (RIMA) that provides on-demand personalized explanations of the recommendations, with three levels of detail (basic, intermediate, advanced) to meet the demands of different types of end-users. We conducted a within-subject study (N=31) to investigate the relationship between user’s personal characteristics and the explanation level of detail, and the effects of these two variables on the perception of the explainable RS with regard to different explanation goals. Our results show that the perception of explainable RS with different levels of detail is affected to different degrees by the explanation goal and user type. Consequently, we suggested some theoretical and design guidelines to support the systematic design of explanatory interfaces in RS tailored to the user’s context.", "year": 2022, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "093cb02ae772cfb01a00fbd80a38ac5c08365ce0", "authors": "Ritesh Damera,A. Shahin,Dawood Nasimi,Florian Richtscheid,Mouadh Guesmi,Arham Muslim,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/093cb02ae772cfb01a00fbd80a38ac5c08365ce0", "title": "How to Design Effective Learning Analytics Indicators? A Human-Centered Design Approach", "abstract": "No abstract available", "year": 2020, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "c0c75aa8ed39e64c79f3f296cdd0e715aaf94a56", "authors": "Arham Muslim,Fangzheng Ji,Yiqi Sun,Shadi Zumor,Thao Ngo,Qurat Ul Ain,Shoeb Joarder,Laura Vorgerd,Mohamed Amine Chatti,Mouadh Guesmi,", "url": "https://www.semanticscholar.org/paper/c0c75aa8ed39e64c79f3f296cdd0e715aaf94a56", "title": "Input or Output: Effects of Explanation Focus on the Perception of Explainable Recommendation with Varying Level of Details", "abstract": "In this paper, we shed light on two important design choices in explainable recommender systems (RS) namely, explanation focus and explanation level of detail. We developed a transparent Recommendation and Interest Modeling Application (RIMA) that provides on-demand personalized explanations of the input (user model) and output (recommendations), with three levels of detail (basic, intermediate, advanced) to meet the demands of different types of end-users. We conducted a within-subject study to investigate the relationship between explanation focus and the explanation level of detail, and the effects of these two variables on the perception of the explainable RS with regard to different explanation aims. Our results show that the perception of explainable RS with different levels of detail is affected to different degrees by the explanation focus. Consequently, we provided some suggestions to support the effective design of explanations in RS.", "year": 2021, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "3f4136118e4f04f80b5c2b6ac6b6ac83fd158c02", "authors": "Arham Muslim,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/3f4136118e4f04f80b5c2b6ac6b6ac83fd158c02", "title": "The PERLA Framework: Blending Personalization and Learning Analytics", "abstract": "Personalization is crucial for achieving smart learning environments in different lifelong learning contexts. There is a need to shift from one-size-fits-all systems to personalized learning environments that give control to the learners. Recently, learning analytics (LA) is opening up new opportunities for promoting personalization by providing insights and understanding into how learners learn and supporting customized learning experiences that meet their goals and needs. This paper discusses the Personalization and Learning Analytics (PERLA) framework which represents the convergence of personalization and learning analytics and provides a theoretical foundation for effective analytics-enhanced personalized learning. The main aim of the PERLA framework is to guide the systematic design and development of effective indicators for personalized learning.", "year": 2019, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "b493b31940c77cff26d7cdae25d83bb4490d5947", "authors": "U. Schroeder,Arnab Chakrabarti,C. Greven,Usman Wahid,A. Yousef,Arham Muslim,Hendrik Thüs,Vlatko Lukarov,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/b493b31940c77cff26d7cdae25d83bb4490d5947", "title": "Learning Analytics: Challenges and Future Research Directions", "abstract": "eleed, Iss. 10 - In recent years, learning analytics (LA) has attracted a great deal of attention in technology-enhanced learning (TEL) research as practitioners, institutions, and researchers are increasingly seeing the potential that LA has to shape the future TEL landscape. Generally, LA deals with the development of methods that harness educational data sets to support the learning process. This paper provides a foundation for future research in LA. It provides a systematic overview on this emerging field and its key concepts through a reference model for LA based on four dimensions, namely data, environments, context (what?), stakeholders (who?), objectives (why?), and methods (how?). It further identifies various challenges and research opportunities in the area of LA in relation to each dimension.", "year": 2014, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "251b560b66d285eb458680316b2bec672aff96d9", "authors": "U. Schroeder,Mohamed Amine Chatti,Arham Muslim,Vlatko Lukarov,A. L. Dyckhoff,", "url": "https://www.semanticscholar.org/paper/251b560b66d285eb458680316b2bec672aff96d9", "title": "Supporting action research with learning analytics", "abstract": "Learning analytics tools should be useful, i.e., they should be usable and provide the functionality for reaching the goals attributed to learning analytics. This paper seeks to unite learning analytics and action research. Based on this, we investigate how the multitude of questions that arise during technology-enhanced teaching and learning systematically can be mapped to sets of indicators. We examine, which questions are not yet supported and propose concepts of indicators that have a high potential of positively influencing teachers' didactical considerations. Our investigation shows that many questions of teachers cannot be answered with currently available research tools. Furthermore, few learning analytics studies report about measuring impact. We describe which effects learning analytics should have on teaching and discuss how this could be evaluated.", "year": 2013, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "8e114b0b00d19f3ab70ccee0356865d73ac7722f", "authors": "Arham Muslim,Fangzheng Ji,Yiqi Sun,Shadi Zumor,Shoeb Joarder,Laura Vorgerd,Mohamed Amine Chatti,Mouadh Guesmi,", "url": "https://www.semanticscholar.org/paper/8e114b0b00d19f3ab70ccee0356865d73ac7722f", "title": "On-demand Personalized Explanation for Transparent Recommendation", "abstract": "The literature on explainable recommendations is already rich. In this paper, we aim to shed light on an aspect that remains under-explored in this area of research, namely providing personalized explanations. To address this gap, we developed a transparent Recommendation and Interest Modeling Application (RIMA) that provides on-demand personalized explanations with varying levels of detail to meet the demands of different types of end-users. The results of a preliminary qualitative user study demonstrated potential benefits in terms of user satisfaction with the explainable recommender system. Our work would contribute to the literature on explainable recommendation by exploring the potential of on-demand personalized explanations, and contribute to the practice by offering suggestions for the design and appropriate use of personalized explanation interfaces in recommender systems.", "year": 2021, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "aa8d38f64df48de2c6de807b2dedd01b70e1a17c", "authors": "U. Schroeder,Memoona Mughal,Mohamed Amine Chatti,Arham Muslim,", "url": "https://www.semanticscholar.org/paper/aa8d38f64df48de2c6de807b2dedd01b70e1a17c", "title": "The Goal - Question - Indicator Approach for Personalized Learning Analytics -", "abstract": "Open learning analytics (OLA) is a relatively new branch of learning analytics (LA) which emerged due to the growing demand for self-organized, networked, and lifelong learning opportunities. OLA deals with learning data collected from various learning environments and contexts, analyzed with a range of analytics methods, and for different stakeholders with diverse interests and objectives. This diversity in different dimensions of OLA is a challenge which needs to be addressed by adopting a personalized learning analytics (PLA) model. Current implementations of LA mainly rely on a predefined set of questions and indicators which is not suitable in the context of OLA where the indicators are unpredictable. In this paper we present the goal question indicator (GQI) approach for PLA and provide the conceptual, design, implementation and evaluation details of the indicator engine component of the open learning analytics platform (OpenLAP) that engages end users in the indicator generation process by supporting them in setting goals, posing questions, and self-defining", "year": 2017, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "7cddc49156d3c9473d4aefbeac2f9e632f78a095", "authors": "Arham Muslim,Mohamed Amine Chatti,U. Schroeder,M. B. Bashir,", "url": "https://www.semanticscholar.org/paper/7cddc49156d3c9473d4aefbeac2f9e632f78a095", "title": "A Modular Visualization Framework for the Open Learning Analytics Platform", "abstract": "No abstract available", "year": 2016, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "39a32cf346bfe3dd9d1df060fa11bae74e526a0b", "authors": "U. Schroeder,Oscal Eduardo Barrios Varela,M. B. Bashir,Mohamed Amine Chatti,Arham Muslim,", "url": "https://www.semanticscholar.org/paper/39a32cf346bfe3dd9d1df060fa11bae74e526a0b", "title": "A Modular and Extensible Framework for Open Learning Analytics", "abstract": "Open Learning Analytics (OLA) is an emerging concept in the field of Learning Analytics (LA). It deals with learning data collected from multiple environments and contexts, analyzed with a wide range of analytics methods to address the requirements of different stakeholders. Due to this diversity in different dimensions of OLA, the LA developers and researchers face numerous challenges while designing solutions for OLA. The Open Learning Analytics Platform (OpenLAP) is a framework that addresses these issues and lays the foundation for an ecosystem of OLA that aims at supporting learning and teaching in fragmented, diverse, and networked learning environments. It follows a user-centric approach to engage end users in flexible definition and dynamic generation of personalized indicators. In this paper, we address a subset of OLA challenges and present the conceptual and implementation details of the analytics framework component of OpenLAP, which follows a flexible architecture that allows the easy integration of new analytics methods and visualization techniques in OpenLAP to support end users in defining indicators based on their needs in order to embed the results into their personal learning environment.", "year": 2018, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "a1c7a95b79a6754dfd2de448364b6e5fbffe9589", "authors": "U. Schroeder,Arham Muslim,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/a1c7a95b79a6754dfd2de448364b6e5fbffe9589", "title": "Toward an Open Learning Analytics Ecosystem", "abstract": "No abstract available", "year": 2017, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "3f204f1eaef37645f1d84ab784d813370704bca7", "authors": "U. Schroeder,T. Mahapatra,Mohamed Amine Chatti,Arham Muslim,", "url": "https://www.semanticscholar.org/paper/3f204f1eaef37645f1d84ab784d813370704bca7", "title": "A rule-based indicator definition tool for personalized learning analytics", "abstract": "In the last few years, there has been a growing interest in learning analytics (LA) in technology-enhanced learning (TEL). Generally, LA deals with the development of methods that harness educational data sets to support the learning process. Recently, the concept of open learning analytics (OLA) has received a great deal of attention from LA community, due to the growing demand for self-organized, networked, and lifelong learning opportunities. A key challenge in OLA is to follow a personalized and goal-oriented LA model that tailors the LA task to the needs and goals of multiple stakeholders. Current implementations of LA rely on a predefined set of questions and indicators. There is, however, a need to adopt a personalized LA approach that engages end users in the indicator definition process by supporting them in setting goals, posing questions, and self-defining the indicators that help them achieve their goals. In this paper, we address the challenge of personalized LA and present the conceptual, design, and implementation details of a rule-based indicator definition tool to support flexible definition and dynamic generation of indicators to meet the needs of different stakeholders with diverse goals and questions in the LA exercise.", "year": 2016, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "081bd8a756f9653a682aa6518f61a1323e04849b", "authors": "Shoeb Joarder,Ravinder Singh,Arham Muslim,Mouadh Guesmi,Fangzheng Ji,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/081bd8a756f9653a682aa6518f61a1323e04849b", "title": "SIMT: A Semantic Interest Modeling Toolkit", "abstract": "In this paper, we focus on semantic interest modeling and present SIMT as a toolkit that harnesses the semantic information to effectively generate user interest models and compute their similarities. SIMT follows a mixed-method approach that combines unsupervised keyword extraction algorithms, knowledge bases, and word embedding techniques to address the semantic issues in the interest modeling task.", "year": 2021, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "5fb4801bd3f26ebdb4f4d7cbc3d4ed6226d29143", "authors": "Mouadh Guesmi,Manpriya Guliani,Arham Muslim,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/5fb4801bd3f26ebdb4f4d7cbc3d4ed6226d29143", "title": "The LAVA Model: Learning Analytics Meets Visual Analytics", "abstract": "No abstract available", "year": 2023, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "0b169b2217facf70183eb32d5e411cf02f992eed", "authors": "Arham Muslim,Qurat Ul Ain,Shoeb Joarder,Thao Ngo,Laura Vorgerd,Mohamed Amine Chatti,Mouadh Guesmi,", "url": "https://www.semanticscholar.org/paper/0b169b2217facf70183eb32d5e411cf02f992eed", "title": "Explaining User Models with Different Levels of Detail for Transparent Recommendation: A User Study", "abstract": "In this paper, we shed light on explaining user models for transparent recommendation while considering user personal characteristics. To this end, we developed a transparent Recommendation and Interest Modeling Application (RIMA) that provides interactive, layered explanations of the user model with three levels of detail (basic, intermediate, advanced) to meet the demands of different types of end-users. We conducted a within-subject study (N=31) to investigate the relationship between personal characteristics and the explanation level of detail, and the effects of these two variables on the perception of the explainable recommender system with regard to different explanation goals. Based on the study results, we provided some suggestions to support the effective design of user model explanations for transparent recommendation.", "year": 2022, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "719227c3b893b68fc5401109c272140a7b040b99", "authors": "Shoeb Joarder,Laura Vorgerd,Arham Muslim,Fangzheng Ji,Shadi Zumor,Yiqi Sun,Mohamed Amine Chatti,Mouadh Guesmi,", "url": "https://www.semanticscholar.org/paper/719227c3b893b68fc5401109c272140a7b040b99", "title": "Open, Scrutable and Explainable Interest Models for Transparent Recommendation", "abstract": "Enhancing explainability in recommender systems has drawn more and more attention in recent years. In this paper, we address two aspects that are under-investigated in explainable recommendation research, namely providing explanations that focus on the input (i.e. user model) and presenting personalized explanations with varying level of details. To address this gap, we propose the transparent Recommendation and Interest Modeling Application (RIMA) that aims at opening, scrutinizing, and explaining the user’s interest model based on three levels of details. The results of a preliminary interview-based user study demonstrated potential benefits in terms of transparency, scrutability, and user satisfaction with the explainable recommender system.", "year": 2021, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "af44e3b95bcb9a431c2ef32f3c42f5d3c8309e01", "authors": "Mouadh Guesmi,Mohamed Amine Chatti,Arham Muslim,", "url": "https://www.semanticscholar.org/paper/af44e3b95bcb9a431c2ef32f3c42f5d3c8309e01", "title": "Open Learning Analytics: A Systematic Literature Review and Future Perspectives", "abstract": "No abstract available", "year": 2023, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "7ba7fe6a96b837b76423fe6e1d40042bd275ad07", "authors": "Shoeb Joarder,Mouadh Guesmi,Arham Muslim,Volkan Yücepur,Mohamed Amine Chatti,", "url": "https://www.semanticscholar.org/paper/7ba7fe6a96b837b76423fe6e1d40042bd275ad07", "title": "Designing Theory-Driven Analytics-Enhanced Self-Regulated Learning Applications", "abstract": "No abstract available", "year": 2023, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "9f52c498da7b9f5555d836ea6cfc4854df05f671", "authors": "U. Schroeder,C. Greven,Arham Muslim,Fatemeh Salehian Kia,Hendrik Thüs,Mohamed Amine Chatti,Vlatko Lukarov,", "url": "https://www.semanticscholar.org/paper/9f52c498da7b9f5555d836ea6cfc4854df05f671", "title": "Data Models in Learning Analytics", "abstract": "There are many different ways and models how to characterize usage data to enable representation of user actions across learning management system, and systems in general. Based on this data, learning analytics can perform different analysis and provide personalized and meaningful information to improve the learning and teaching processes. There is a variety of usage data formats that are already successfully used in exiting systems. These different usage data formats have their advantages and disadvantage that have to be considered when using them in the context of learning analytics. In this paper, several usage data formats are presented and analyzed in the context of learning analytics to help in choosing the best suiting usage data model.", "year": 2014, "updated_on": "2022", "created_on": "2022"}], "interests": ["user modeling", "educational technology", "lifelong learning", "artificial intelligence", "learning technologies", "gamification", "higher education", "open educational resources", "anti-phishing", "serious games", "cybersecurity", "xAPI"], "score": 19, "id": "34602017"}, {"name": "K. Verbert", "paper": [{"id": 1, "paper_id": "e0d149c6b0d254399739f409865a577f003f3d8e", "authors": "K. Verbert,E. Duval,Karsten Seipp,Yucheng Jin,", "url": "https://www.semanticscholar.org/paper/e0d149c6b0d254399739f409865a577f003f3d8e", "title": "Go With the Flow: Effects of Transparency and User Control on Targeted Advertising Using Flow Charts", "abstract": "Targeted advertising reaches users based on various traits, such as demographics or behaviour. However, users are often reluctant to accept ads. We hypothesise that users are more open to targeted advertising if they can inspect, control and thereby understand the process of ad selection. We conducted a between-subjects study (N=200) to investigate to what extent four key aspects of ads (Quality, Behavioural Intention, Understanding and Attitude) may be affected by transparency and user control using a flow chart. Our results indicate that positive effects of flow charts reported from other domains may also be applicable to advertising: Using flow charts to provide transparency together with user control is found to have more positive effects on domain-specific quality measures than established, text-based approaches and using either of the techniques in isolation. The paper concludes with recommendations for practitioners aiming to improve user response to ads.", "year": 2016, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "0e786533e291e0a726f508cd4122db18df4a4ca4", "authors": "E. Duval,Peter Brusilovsky,Denis Parra,K. Verbert,", "url": "https://www.semanticscholar.org/paper/0e786533e291e0a726f508cd4122db18df4a4ca4", "title": "Visualizing recommendations to support exploration, transparency and controllability", "abstract": "Research on recommender systems has traditionally focused on the development of algorithms to improve accuracy of recommendations. So far, little research has been done to enable user interaction with such systems as a basis to support exploration and control by end users. In this paper, we present our research on the use of information visualization techniques to interact with recommender systems. We investigated how information visualization can improve user understanding of the typically black-box rationale behind recommendations in order to increase their perceived relevance and meaning and to support exploration and user involvement in the recommendation process. Our study has been performed using TalkExplorer, an interactive visualization tool developed for attendees of academic conferences. The results of user studies performed at two conferences allowed us to obtain interesting insights to enhance user interfaces that integrate recommendation technology. More specifically, effectiveness and probability of item selection both increase when users are able to explore and interrelate multiple entities -- i.e. items bookmarked by users, recommendations and tags.", "year": 2013, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "618b97ccf1f803d6351b603a1f938a228cd366ad", "authors": "K. Verbert,Yucheng Jin,N. Htun,Martijn Millecamp,", "url": "https://www.semanticscholar.org/paper/618b97ccf1f803d6351b603a1f938a228cd366ad", "title": "Controlling Spotify Recommendations: Effects of Personal Characteristics on Music Recommender User Interfaces", "abstract": "The \"black box'' nature of today's recommender systems raises a number of challenges for users, including a lack of trust and limited user control. Providing more user control is interesting to enable end-users to help steer the recommendation process with additional input and feedback. However, different users may have different preferences with regard to such control. To the best of our knowledge, no research has investigated the effect of personal characteristics on visual control techniques in the music recommendation domain. In this paper, we present results of a user study on the web using two different visualisation techniques (a radar chart and sliders) that allows users to control Spotify recommendations. A within-subject design withLatin Square counterbalancing measures was used for the study. Results indicate that the radar chart helped the participants discover a significantly higher number of new songs compared to the sliders. We also found that users' experience with Spotify had an influence on their interaction with different musical attributes. The participants who used Spotify frequently and users with a high individual musical sophistication interacted with the attributes significantly more with the radar chart compared to the sliders. Individual musical sophistication also had a significant impact on their interaction with the interaction techniques. The participants with high musical sophistication interacted significantly more with the radar chart in comparison to the sliders. Based on the feedback from our participants, we provide design suggestions to further improve user control in music recommendation.", "year": 2018, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "716090a4185e2e309460d55377dafa6eeaee65ba", "authors": "E. Duval,K. Verbert,H. Drachsler,N. Manouselis,", "url": "https://www.semanticscholar.org/paper/716090a4185e2e309460d55377dafa6eeaee65ba", "title": "Recommender Systems for Learning", "abstract": "No abstract available", "year": 2012, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "9eef97f734b0799637defe17ea301c1136fc8397", "authors": "K. Verbert,N. Tintarev,Yucheng Jin,", "url": "https://www.semanticscholar.org/paper/9eef97f734b0799637defe17ea301c1136fc8397", "title": "Effects of personal characteristics on music recommender systems with different levels of controllability", "abstract": "Previous research has found that enabling users to control the recommendation process increases user satisfaction. However, providing additional controls also increases cognitive load, and different users have different needs for control. Therefore, in this study, we investigate the effect of two personal characteristics: musical sophistication and visual memory capacity. We designed a visual user interface, on top of a commercial music recommender, with different controls: interactions with recommendations (i.e., the output of a recommender system), the user profile (i.e., the top listened songs), and algorithm parameters (i.e., weights in an algorithm). We created eight experimental settings with combinations of these three user controls and conducted a between-subjects study (N=240), to explore the effect on cognitive load and recommendation acceptance for different personal characteristics. We found that controlling recommendations is the most favorable single control element. In addition, controlling user profile and algorithm parameters was the most beneficial setting with multiple controls. Moreover, the participants with high musical sophistication perceived recommendations to be of higher quality, which in turn lead to higher recommendation acceptance. However, we found no effect of visual working memory on either cognitive load or recommendation acceptance. This work contributes an understanding of how to design control that hits the sweet spot between the perceived quality of recommendations and acceptable cognitive load.", "year": 2018, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "ed9f58be24ea07c80d188937d51c885ec78915d0", "authors": "A. Pardo,E. Duval,K. Verbert,Sten Govaerts,", "url": "https://www.semanticscholar.org/paper/ed9f58be24ea07c80d188937d51c885ec78915d0", "title": "The student activity meter for awareness and self-reflection", "abstract": "Visualization of user actions can be used in Technology Enhanced Learning to increase awareness for learners and teachers and to support self-reflection. In this paper, we present our Student Activity Meter that visualizes learner actions. We present four design iterations and results of both quantitative and qualitative evaluation studies in real-world settings that assess the usability, use and usefulness of different visualizations. Results indicate that our tool is useful for a variety of teacher and learner needs, including awareness of time spent and resource use. Tools like SAM can also be deployed in other settings that require awareness and self-reflection, e.g. in personal informatics and health monitoring, where motivated users will value the flexible mechanisms to analyze trending data.", "year": 2012, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "b9a541fc69c4b6825aa9cf4b207e812c716b25fb", "authors": "José Luís Santos,Sten Govaerts,J. Klerkx,E. Duval,K. Verbert,", "url": "https://www.semanticscholar.org/paper/b9a541fc69c4b6825aa9cf4b207e812c716b25fb", "title": "Learning Analytics Dashboard Applications", "abstract": "This article introduces learning analytics dashboards that visualize learning traces for learners and teachers. We present a conceptual framework that helps to analyze learning analytics applications for these kinds of users. We then present our own work in this area and compare with 15 related dashboard applications for learning. Most evaluations evaluate only part of our conceptual framework and do not assess whether dashboards contribute to behavior change or new understanding, probably also because such assessment requires longitudinal studies.", "year": 2013, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "05171a1a40c46ec38fdb74fa1833cf03248c9990", "authors": "K. Verbert,N. Tintarev,Yucheng Jin,", "url": "https://www.semanticscholar.org/paper/05171a1a40c46ec38fdb74fa1833cf03248c9990", "title": "Effects of Individual Traits on Diversity-Aware Music Recommender User Interfaces", "abstract": "When recommendations become increasingly personalized, users are often presented with a narrower range of content. To mitigate this issue, diversity-enhanced user interfaces for recommender systems have in the past found to be effective in increasing overall user satisfaction with recommendations. However, users may have different requirements for diversity, and consequently different visualization requirements. In this paper, we evaluate two visual user interfaces, SimBub and ComBub, to present the diversity of a music recommender system from different perspectives. SimBub is a baseline bubble chart that shows music genres and popularity by color and size, respectively. In addition, ComBub visualizes selected audio features along the X and Y axis in a more advanced and complex visualization. Our goal is to investigate how individual traits such as musical sophistication (MS) and visual memory (VM) influence the satisfaction of the visualization for perceived music diversity, overall usability, and support to identify blind-spots. We hypothesize that music experts, or people with better visual memory, will perceive higher diversity in ComBub than SimBub. A within-subjects user study (N=83) is conducted to compare these two visualizations. Results of our study show that participants with high MS and VM tend to perceive significantly higher diversity from ComBub compared to SimBub. In contrast, participants with low MS perceived significantly higher diversity from SimBub than ComBub; however, no significant result is found for the participants with low VM. Our research findings show the necessity of considering individual traits while designing diversity-aware interfaces.", "year": 2018, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "8a6e6ad4ce8a5d828af85e389b52ce659eb29366", "authors": "K. Verbert,Françeska Xhakaj,Dan Davis,I. Jivet,V. Aleven,J. Kay,Robert Bodily,", "url": "https://www.semanticscholar.org/paper/8a6e6ad4ce8a5d828af85e389b52ce659eb29366", "title": "Open learner models and learning analytics dashboards: a systematic review", "abstract": "This paper aims to link student facing Learning Analytics Dashboards (LADs) to the corpus of research on Open Learner Models (OLMs), as both have similar goals. We conducted a systematic review of literature on OLMs and compared the results with a previously conducted review of LADs for learners in terms of (i) data use and modelling, (ii) key publication venues, (iii) authors and articles, (iv) key themes, and (v) system evaluation. We highlight the similarities and differences between the research on LADs and OLMs. Our key contribution is a bridge between these two areas as a foundation for building upon the strengths of each. We report the following key results from the review: in reports of new OLMs, almost 60% are based on a single type of data; 33% use behavioral metrics; 39% support input from the user; 37% have complex models; and just 6% involve multiple applications. Key associated themes include intelligent tutoring systems, learning analytics, and self-regulated learning. Notably, compared with LADs, OLM research is more likely to be interactive (81% of papers compared with 31% for LADs), report evaluations (76% versus 59%), use assessment data (100% versus 37%), provide a comparison standard for students (52% versus 38%), but less likely to use behavioral metrics, or resource use data (33% against 75% for LADs). In OLM work, there was a heightened focus on learner control and access to their own data.", "year": 2018, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "1c26c12708a5383429fb26232b9d0ec6029d50cc", "authors": "K. Verbert,Robert Bodily,", "url": "https://www.semanticscholar.org/paper/1c26c12708a5383429fb26232b9d0ec6029d50cc", "title": "Review of Research on Student-Facing Learning Analytics Dashboards and Educational Recommender Systems", "abstract": "This article is a comprehensive literature review of student-facing learning analytics reporting systems that track learning analytics data and report it directly to students. This literature review builds on four previously conducted literature reviews in similar domains. Out of the 945 articles retrieved from databases and journals, 93 articles were included in the analysis. Articles were coded based on the following five categories: functionality, data sources, design analysis, student perceptions, and measured effects. Based on this review, we need research on learning analytics reporting systems that targets the design and development process of reporting systems, not only the final products. This design and development process includes needs analyses, visual design analyses, information selection justifications, and student perception surveys. In addition, experiments to determine the effect of these systems on student behavior, achievement, and skills are needed to add to the small existing body of evidence. Furthermore, experimental studies should include usability tests and methodologies to examine student use of these systems, as these factors may affect experimental findings. Finally, observational study methods, such as propensity score matching, should be used to increase student access to these systems but still rigorously measure experimental effects.", "year": 2017, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "ede1bb65603db66d52e78d7b41df0d9a23592777", "authors": "R. Baker,K. Verbert,E. Duval,Rebecca Ferguson,S. B. Shum,S. Dawson,C. Haythornthwaite,D. Gašević,George Siemens,", "url": "https://www.semanticscholar.org/paper/ede1bb65603db66d52e78d7b41df0d9a23592777", "title": "Open Learning Analytics: an integrated modularized platform", "abstract": "No abstract available", "year": 2011, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "faa9ebe729b706ef49437baac1902826471a9022", "authors": "E. Duval,H. Drachsler,N. Manouselis,K. Verbert,", "url": "https://www.semanticscholar.org/paper/faa9ebe729b706ef49437baac1902826471a9022", "title": "Dataset-Driven Research to Support Learning and Knowledge Analytics", "abstract": "Verbert, K., Manouselis, N., Drachsler, H., & Duval, E. (2012). Dataset-Driven Research to Support Learning and Knowledge Analytics. Educational Technology & Society, 15(3), 133–148.", "year": 2012, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "81f030002cc3eb57e74570a4e20b01a26ebb6ef1", "authors": "K. Verbert,Laurens Naudts,D. Geerts,J. Ausloos,Pierre Dewitte,Oscar Luis Alvarado Rodriguez,Luciana Monteiro Krebs,", "url": "https://www.semanticscholar.org/paper/81f030002cc3eb57e74570a4e20b01a26ebb6ef1", "title": "Tell Me What You Know: GDPR Implications on Designing Transparency and Accountability for News Recommender Systems", "abstract": "The GDPR has a significant impact on the way users interact with technologies, especially the everyday platforms used to personalize news and related forms of information. This paper presents the initial results from a study whose primary objective is to empirically test those platforms' level of compliance with the so-called 'right to explanation'. Four research topics considered as gaps in existing legal and HCI scholarship originated from the project's initial phase, namely (1) GDPR compliance through user-centered design; (2) the inclusion of values in the system; (3) design considerations regarding interaction strategies, algorithmic experience, transparency, and explanations; and (4) technical challenges. The second phase is currently ongoing and allows us to make some observations regarding the registration process and the privacy policies of three categories of news actors: first-party content providers, news aggregators and social media platforms.", "year": 2019, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "a9fddccdc03fcf578dbbb89820ab9f4890579bf5", "authors": "J. Klerkx,Gonzalo Parra,F. Assche,José Luís Santos,E. Duval,Sten Govaerts,K. Verbert,", "url": "https://www.semanticscholar.org/paper/a9fddccdc03fcf578dbbb89820ab9f4890579bf5", "title": "Learning dashboards: an overview and future research opportunities", "abstract": "No abstract available", "year": 2014, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "60a40230d5540e4b0a5063c1e35860c7053c0dc9", "authors": "K. Verbert,C. Conati,Martijn Millecamp,", "url": "https://www.semanticscholar.org/paper/60a40230d5540e4b0a5063c1e35860c7053c0dc9", "title": "“Knowing me, knowing you”: personalized explanations for a music recommender system", "abstract": "No abstract available", "year": 2022, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "a8a49517f6eff81ad143f8271fe0a50259f50932", "authors": "K. Verbert,G. Štiglic,Jeroen Ooge,", "url": "https://www.semanticscholar.org/paper/a8a49517f6eff81ad143f8271fe0a50259f50932", "title": "Explaining artificial intelligence with visual analytics in healthcare", "abstract": "To make predictions and explore large datasets, healthcare is increasingly applying advanced algorithms of artificial intelligence. However, to make well‐considered and trustworthy decisions, healthcare professionals require ways to gain insights in these algorithms' outputs. One approach is visual analytics, which integrates humans in decision‐making through visualizations that facilitate interaction with algorithms. Although many visual analytics systems have been developed for healthcare, a clear overview of their explanation techniques is lacking. Therefore, we review 71 visual analytics systems for healthcare, and analyze how they explain advanced algorithms through visualization, interaction, shepherding, and direct explanation. Based on our analysis, we outline research opportunities and challenges to further guide the exciting rapprochement of visual analytics and healthcare.", "year": 2021, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "2c4ec32d7924b467c201ebafcfafa068ff299128", "authors": "K. Verbert,E. Duval,", "url": "https://www.semanticscholar.org/paper/2c4ec32d7924b467c201ebafcfafa068ff299128", "title": "On the Role of Technical Standards for Learning Technologies", "abstract": "This paper presents some of the lessons that we have learned during our involvement with the development of learning technology standards. We believe that the decision to develop a new standards is sometimes taken too quickly and that, when possible, existing generic standards should be profiled for the domain of learning. At this point in time, the development of tools, technologies and methodologies that fully exploit the affordances of existing standards is more relevant than the development of new standards. Moreover, we believe that the relationship between technical standardization and research is often misunderstood: the main role of standards for research is to enable a large-scale technological infrastructure that promotes innovation through its open nature.", "year": 2008, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "262aa57fc3d3addbda64830b236f385af0790265", "authors": "K. Verbert,E. Duval,", "url": "https://www.semanticscholar.org/paper/262aa57fc3d3addbda64830b236f385af0790265", "title": "Learning Analytics — eleed", "abstract": "Introduction This paper provides a brief introduction to the domain of 'learning analytics'. We first explain the background and idea behind the concept. Then we give a brief overview of current research issues. We briefly list some more controversial issues before concluding.", "year": 2015, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "56ba8985d0d6559498322d8da7290e146783f7b2", "authors": "K. Verbert,Denis Parra,Chen He,", "url": "https://www.semanticscholar.org/paper/56ba8985d0d6559498322d8da7290e146783f7b2", "title": "Interactive recommender systems: A survey of the state of the art and future research challenges and opportunities", "abstract": "No abstract available", "year": 2016, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "48c8106171ce102ecad28debdbff867981f5b08f", "authors": "K. Verbert,C. Conati,N. Htun,Martijn Millecamp,", "url": "https://www.semanticscholar.org/paper/48c8106171ce102ecad28debdbff867981f5b08f", "title": "To explain or not to explain: the effects of personal characteristics when explaining music recommendations", "abstract": "Recommender systems have been increasingly used in online services that we consume daily, such as Facebook, Netflix, YouTube, and Spotify. However, these systems are often presented to users as a \"black box\", i.e. the rationale for providing individual recommendations remains unexplained to users. In recent years, various attempts have been made to address this black box issue by providing textual explanations or interactive visualisations that enable users to explore the provenance of recommendations. Among other things, results demonstrated benefits in terms of precision and user satisfaction. Previous research had also indicated that personal characteristics such as domain knowledge, trust propensity and persistence may also play an important role on such perceived benefits. Yet, to date, little is known about the effects of personal characteristics on explaining recommendations. To address this gap, we developed a music recommender system with explanations and conducted an online study using a within-subject design. We captured various personal characteristics of participants and administered both qualitative and quantitative evaluation methods. Results indicate that personal characteristics have significant influence on the interaction and perception of recommender systems, and that this influence changes by adding explanations. For people with a low need for cognition are the explained recommendations the most beneficial. For people with a high need for cognition, we observed that explanations could create a lack of confidence. Based on these results, we present some design implications for explaining recommendations.", "year": 2019, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "e7f9bfa23bcbe51c94dbcce3e59d9bf725b31f52", "authors": "E. Duval,K. Verbert,J. Klerkx,", "url": "https://www.semanticscholar.org/paper/e7f9bfa23bcbe51c94dbcce3e59d9bf725b31f52", "title": "Learning analytics dashboards", "abstract": "No abstract available", "year": 2017, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "8b54eae687cf4632a0a6da7ac0fbd0ffca5540b9", "authors": "P. Kirschner,S. Järvelä,K. Verbert,Jonna Malmberg,Gayane Sedrakyan,", "url": "https://www.semanticscholar.org/paper/8b54eae687cf4632a0a6da7ac0fbd0ffca5540b9", "title": "Linking learning behavior analytics and learning science concepts: Designing a learning analytics dashboard for feedback to support learning regulation", "abstract": "No abstract available", "year": 2020, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "dac98d37bf71b824bedb4abf07833023c6491904", "authors": "T. Laet,G. Langie,C. V. Soom,K. Verbert,L. Peeters,Tom Broos,", "url": "https://www.semanticscholar.org/paper/dac98d37bf71b824bedb4abf07833023c6491904", "title": "Dashboard for Actionable Feedback on Learning Skills: Scalability and Usefulness", "abstract": "No abstract available", "year": 2017, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "2537ea704f17274c4e634b0d7034980c7d6f8849", "authors": "K. Verbert,Martijn Millecamp,Maxwell Szymanski,", "url": "https://www.semanticscholar.org/paper/2537ea704f17274c4e634b0d7034980c7d6f8849", "title": "Visual, textual or hybrid: the effect of user expertise on different explanations", "abstract": "As the use of AI algorithms keeps rising continuously, so does the need for their transparency and accountability. However, literature often adopts a one-size-fits-all approach for developing explanations when in practice, the type of explanations needed depends on the type of end-user. This research will look at user expertise as a variable to see how different levels of expertise influence the understanding of explanations. The first iteration consists of developing two common types of explanations (visual and textual explanations) that explain predictions made by a general class of predictive model learners. These explanations are then evaluated by users of different expertise backgrounds to compare the understanding and ease-of-use of each type of explanation with respect to the different expertise groups. Results show strong differences between experts and lay users when using visual and textual explanations, as well as lay users having a preference for visual explanations which they perform significantly worse with. To solve this problem, the second iteration of this research focuses on the shortcomings of the first two explanations and tries to minimize the difference in understanding between both expertise groups. This is done through the means of developing and testing a candidate solution in the form of hybrid explanations, which essentially combine both visual and textual explanations. This hybrid form of explanations shows a significant improvement in terms of correct understanding (for lay users in particular) when compared to visual explanations, whilst not compromising on ease-of-use at the same time.", "year": 2021, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "8bc39fface0bb9c9b146b66b470645c5bd0ca58c", "authors": "T. De Laet,K. Verbert,J. Klerkx,A. Moere,Sven Charleer,", "url": "https://www.semanticscholar.org/paper/8bc39fface0bb9c9b146b66b470645c5bd0ca58c", "title": "Learning Analytics Dashboards to Support Adviser-Student Dialogue", "abstract": "This paper presents LISSA (“Learning dashboard for Insights and Support during Study Advice”), a learning analytics dashboard designed, developed, and evaluated in collaboration with study advisers. The overall objective is to facilitate communication between study advisers and students by visualizing grade data that is commonly available in any institution. More specifically, the dashboard attempts to support the dialogue between adviser and student through an overview of study progress, peer comparison, and by triggering insights based on facts as a starting point for discussion and argumentation. We report on the iterative design process and evaluation results of a deployment in 97 advising sessions. We have found that the dashboard supports the current adviser-student dialogue, helps them motivate students, triggers conversation, and provides tools to add personalization, depth, and nuance to the advising session. It provides insights at a factual, interpretative, and reflective level and allows both adviser and student to take an active role during the session.", "year": 2018, "updated_on": "2022", "created_on": "2022"}, {"id": 1, "paper_id": "e959d95fb3fc9d21fd3353e59d2f866958d6be8c", "authors": "E. Duval,Riina Vuorikari,M. Wolpers,N. Manouselis,H. Drachsler,K. Verbert,", "url": "https://www.semanticscholar.org/paper/e959d95fb3fc9d21fd3353e59d2f866958d6be8c", "title": "Dataset-driven research for improving recommender systems for learning", "abstract": "In the world of recommender systems, it is a common practice to use public available datasets from different application environments (e.g. MovieLens, Book-Crossing, or Each-Movie) in order to evaluate recommendation algorithms. These datasets are used as benchmarks to develop new recommendation algorithms and to compare them to other algorithms in given settings. In this paper, we explore datasets that capture learner interactions with tools and resources. We use the datasets to evaluate and compare the performance of different recommendation algorithms for learning. We present an experimental comparison of the accuracy of several collaborative filtering algorithms applied to these TEL datasets and elaborate on implicit relevance data, such as downloads and tags, that can be used to improve the performance of recommendation algorithms.", "year": 2011, "updated_on": "2022", "created_on": "2022"}], "interests": ["user modeling", "educational technology", "lifelong learning", "artificial intelligence", "learning technologies", "gamification", "higher education", "open educational resources", "anti-phishing", "serious games", "cybersecurity", "xAPI"], "score": 26, "id": "2629441"}]