{"do_lower_case": true, "unk_token": "[UNK]", "sep_token": "[SEP]", "pad_token": "[PAD]", "cls_token": "[CLS]", "mask_token": "[MASK]", "tokenize_chinese_chars": true, "strip_accents": null, "do_basic_tokenize": true, "never_split": null, "model_max_length": 512, "name_or_path": "C:\\Users\\lamee/.cache\\torch\\sentence_transformers\\sentence-transformers_msmarco-distilbert-base-tas-b\\", "special_tokens_map_file": "/home/ukp-reimers/.cache/huggingface/transformers/ba1a276969ccad7ea2344196e7b8561b36292db74bff940ee316dadc05d005d3.dd8bd9bfd3664b530ea4e645105f557769387b3da9f79bdb55ed556bdd80611d", "tokenizer_class": "DistilBertTokenizer"}